ext_alsav/DataProcessors/ПомошникСозданияСборок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПомошникСозданияСборок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/Enums/ВариантыОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыОбеспечения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИзЗаказов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Требуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеТребуется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгрузитьОбособленно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияБезПереходаПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеализацияКлиентуРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпорту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпортуТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСТоварыВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтРозничногоПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтХранителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СборкаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазборкаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеОплатыПоПлатежнойКарте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрочееПоступлениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствСДругогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоДепозитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоступлениеДенежныхСредствПоЗаймамВыданным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПогашениеЗаймаСотрудником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратНеперечисленныхДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/СтатусыПриходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыПриходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КОтбору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/ДействияСоСтрокамиОрдеровНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДействияСоСтрокамиОрдеровНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгрузить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Enums/СтатусыВнутреннихЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыВнутреннихЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ext_alsav/Documents/ЗаказНаСборку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаСборку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВнутреннихЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НазначениеТовары</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВариантОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/Documents/СборкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СборкаТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказНаСборку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаСборку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ext_alsav/DataProcessors/ПомошникСозданияСборок/Ext/ManagerModule.bsl
Функция ЗаполнитьСписокСборок(массивЗаказов, номерСтроки = -1) ЭКСПОРТ
	
	массивВариантовОбоеспечения = Новый Массив;
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.ИзЗаказов);	
	массивВариантовОбоеспечения.Добавить(Перечисления.ВариантыОбеспечения.Требуется);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("массивЗаказов", массивЗаказов);
	Запрос.УстановитьПараметр("номерСтроки", номерСтроки);
	Запрос.УстановитьПараметр("массивВариантовОбоеспечения", массивВариантовОбоеспечения);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
	               |	ИСТИНА КАК ОтметитьКЗаказу,
	               |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	               |	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	               |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество,
	               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	               |	ЗаказКлиентаТовары.Ссылка.Организация КАК Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Подразделение КАК Подразделение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	               |	ЗаказКлиентаТовары.Упаковка КАК Упаковка
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка В(&массивЗаказов)
	               |	И ЗаказКлиентаТовары.ВариантОбеспечения В(&массивВариантовОбоеспечения)
	               |	И (&номерСтроки = -1
	               |			ИЛИ ЗаказКлиентаТовары.НомерСтроки = &номерСтроки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	ЗаказКлиентаТовары.Характеристика,
	               |	ЗаказКлиентаТовары.Упаковка,
	               |	ЗаказКлиентаТовары.Ссылка.Организация,
	               |	ЗаказКлиентаТовары.Ссылка.Подразделение,
	               |	ЗаказКлиентаТовары.Ссылка.Склад";
	
	тчСборки = Запрос.Выполнить().Выгрузить();
	Возврат тчСборки;
	
КонецФункции



Функция НайтиСозданныеЗаказыНаСборку(тчСборки)ЭКСПОРТ
	Если Ложь Тогда тчСборки = Новый ТаблицаЗначений; КонецЕсли;
	
	Если тчСборки.Колонки.Найти("ОтметитьКЗаказу") =  неопределено Тогда
		тчСборки.Колонки.Добавить("ОтметитьКЗаказу");
	КонецЕсли;
	
	Если тчСборки.Колонки.Найти("ЗаказНаСборку") =  неопределено Тогда
		тчСборки.Колонки.Добавить("ЗаказНаСборку");
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заказ.Ссылка КАК Ссылка,
	               |	Заказ.Количество КАК Количество,
	               |	Заказ.КоличествоУпаковок КАК КоличествоУпаковок,
	               |	Сборка.Ссылка КАК СборкаТоваров
	               |ИЗ
	               |	Документ.ЗаказНаСборку КАК Заказ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
	               |		ПО (Сборка.ЗаказНаСборку = Заказ.Ссылка)
	               |			И (Сборка.Проведен = ИСТИНА)
	               |ГДЕ
	               |	Заказ.Проведен = ИСТИНА
	               |	И Заказ.ДокументОснование = &ДокументОснование
	               |	И Заказ.Номенклатура = &Номенклатура
	               |	И Заказ.Характеристика = &Характеристика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Заказ.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК Заказ
	               |ГДЕ
	               |	Заказ.Ссылка = &ДокументОснование
	               |	И Заказ.Номенклатура = &Номенклатура
	               |	И Заказ.Характеристика = &Характеристика";
	
	
	мНовыеСтроки = новый Массив;
				   
	Для Каждого стр из тчСборки Цикл
		Запрос.УстановитьПараметр("ДокументОснование",стр.ЗаказКлиента);
		Запрос.УстановитьПараметр("Номенклатура",стр.Номенклатура);
		Запрос.УстановитьПараметр("Характеристика",стр.Характеристика);
		
		результатыВыполнения = Запрос.ВыполнитьПакет();
		
		всегоТребуется =0;
		Рез = результатыВыполнения[1].Выбрать();
		Пока Рез.Следующий() Цикл
			всегоТребуется = всегоТребуется + Рез.Количество; 
		КонецЦикла;
		
		Рез = результатыВыполнения[0].Выбрать();
		количествоВЗаказе = стр.Количество;
		Пока Рез.Следующий() Цикл
			Если всегоТребуется > Рез.Количество Тогда
				всегоТребуется = всегоТребуется - Рез.Количество;
			Иначе
				стр.ЗаказНаСборку = Рез.Ссылка;
			КонецЕсли; 
			//Если стр.Количество > Рез.Количество Тогда
			//	стр.Количество = стр.Количество - Рез.Количество; 
			//	стр.КоличествоУпаковок = стр.Количество;
			//Иначе
			//	стр.ЗаказНаСборку = Рез.Ссылка;
			//КонецЕсли; 
		КонецЦикла;     
		
		Если стр.Количество > количествоВЗаказе Тогда
			стр.Количество = количествоВЗаказе;
			стр.КоличествоУпаковок = стр.Количество;
		Иначе
		КонецЕсли;
		
		стр.ОтметитьКЗаказу = НЕ(ЗначениеЗаполнено(стр.ЗаказНаСборку) ИЛИ стр.Количество <= 0);
	КонецЦикла;
	
	возврат тчСборки;
КонецФункции


Функция ЗаполнитьВариантыКомплектации(тчСборки)ЭКСПОРТ
	Если Ложь Тогда тчСборки = Новый ТаблицаЗначений; КонецЕсли;
	
	Если тчСборки.Колонки.Найти("ВариантКомплектации") =  неопределено Тогда
		тчСборки.Колонки.Добавить("ВариантКомплектации");
	КонецЕсли;
	
	Для Каждого Стр из тчСборки Цикл
		Если НЕ ЗначениеЗаполнено(стр.ВариантКомплектации) Тогда 
			стр.ВариантКомплектации = Справочники.ВариантыКомплектацииНоменклатуры.ПолучитьОсновнуюКомплектацию(
				Стр.Номенклатура, 
				Стр.Характеристика
			);
		КонецЕсли;
	КонецЦикла;
КонецФункции


Функция СоздатьСборку(заказ)ЭКСПОРТ
	результ = Документы.СборкаТоваров.ПустаяСсылка();
	//Попытка
		УстановитьОбеспечениеЗаказа(Заказ);
		нДок = Документы.СборкаТоваров.СоздатьДокумент();
		нДок.ЗаказНаСборку = заказ;
		
		структураЗаполнения = новый Структура("МассивЗаказов,РеквизитыШапки");
		структураЗаполнения.МассивЗаказов = Новый Массив;
		структураЗаполнения.МассивЗаказов.Добавить(заказ);
		структураЗаполнения.РеквизитыШапки = Новый Структура("Склад,ХозяйственнаяОперация,ВариантПриемкиТоваров,Ссылка,Организация,Подразделение,НаправлениеДеятельности");
		ЗаполнитьЗначенияСвойств(структураЗаполнения.РеквизитыШапки,заказ);
		
		нДок.Заполнить(структураЗаполнения);
		нДок.Дата = ТекущаяДата();
		
		нДок.РаспределитьНомераГТД();
		нДок.Записать(РежимЗаписиДокумента.Запись);
		нДок.Записать(РежимЗаписиДокумента.Проведение);
		
		результ = нДок.Ссылка;
		
		//Создание ордера
		//Если СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(нДок.Склад, нДок.Дата) Тогда
			
			//СоздатьОрдерДляСборки(нДок);
			//СоздатьОрдерДляСборки(заказ);
		//	СоздатьОрдерДляСборки(нДок.Ссылка);
			
		//КонецЕсли;
		
	//Исключение
	//Конецпопытки;
	
	возврат результ;
КонецФункции

Функция СоздатьОрдерДляСборки(сборка) ЭКСПОРТ
	Если СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(сборка.Склад, сборка.Дата) Тогда
		ордер = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
		
		данныеДляЗаполнения = новый Структура();
		данныеДляЗаполнения.Вставить("ДатаВходящегоДокумента",сборка.Дата);
		данныеДляЗаполнения.Вставить("ДатаПоступления",ТекущаяДата());
		данныеДляЗаполнения.Вставить("ЗакрыватьГрафикПоступления", ложь);
		данныеДляЗаполнения.Вставить("ЗонаПриемки", Справочники.СкладскиеЯчейки.ПустаяСсылка());
		данныеДляЗаполнения.Вставить("НомерВходящегоДокумента", сборка.Номер);
		данныеДляЗаполнения.Вставить("Отправитель",сборка.Склад);
		данныеДляЗаполнения.Вставить("Помещение",Справочники.СкладскиеПомещения.ПустаяСсылка());
		данныеДляЗаполнения.Вставить("Распоряжение", сборка.Ссылка);
		данныеДляЗаполнения.Вставить("Склад",сборка.Склад);
		данныеДляЗаполнения.Вставить("ХозяйственнаяОперация",Перечисления.ХозяйственныеОперации.СборкаТоваров);
		
		
		ордер.Заполнить(данныеДляЗаполнения);
		ордер.Дата = ТекущаяДата();
		
		ордер.ЗаполнитьТоварыПоТоварамКПоступлению("НоменклатураКоличество", ордер.Дата);
		
		ордер.Статус =Перечисления.СтатусыПриходныхОрдеров.Принят;
		ордер.ЗакрыватьГрафикПоступления = Истина;
		ордер.Записать(РежимЗаписиДокумента.Запись);
		ордер.Записать(РежимЗаписиДокумента.Проведение);

		Возврат ордер.Ссылка;
	КонецЕсли;
КонецФункции                   

Функция СоздатьОрдерДляСборкиРасходный(сборка) ЭКСПОРТ           
	
	Если ЛОЖЬ Тогда сборка = Документы.СборкаТоваров.ПустаяСсылка(); КонецЕсли;
	
	Если СкладыСервер.ИспользоватьОрдернуюСхемуПриОтгрузке(сборка.Склад, сборка.Дата) Тогда
		ордер = Документы.РасходныйОрдерНаТовары.СоздатьДокумент();
		
		данныеДляЗаполнения = новый Структура();
		данныеДляЗаполнения.Вставить("ДатаВходящегоДокумента",сборка.Дата);
		данныеДляЗаполнения.Вставить("ДатаОтгрузки",ТекущаяДата());
		данныеДляЗаполнения.Вставить("ЗакрыватьГрафикОтгрузки", ложь);
		данныеДляЗаполнения.Вставить("ЗонаПриемки", Справочники.СкладскиеЯчейки.ПустаяСсылка());
		данныеДляЗаполнения.Вставить("НомерВходящегоДокумента", сборка.Номер);
		данныеДляЗаполнения.Вставить("Получатель",сборка.Склад);
		данныеДляЗаполнения.Вставить("Помещение",Справочники.СкладскиеПомещения.ПустаяСсылка());
		//данныеДляЗаполнения.Вставить("Распоряжение", сборка.Ссылка);
		данныеДляЗаполнения.Вставить("Распоряжение", сборка.Ссылка.ЗаказНаСборку);
		данныеДляЗаполнения.Вставить("Склад",сборка.Склад);
		данныеДляЗаполнения.Вставить("СкладскаяОперация",Перечисления.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки);
		
		ЗаполнитьЗначенияСвойств(ордер, данныеДляЗаполнения);
		
		ордер.Заполнить(данныеДляЗаполнения);
		ордер.Дата = ТекущаяДата();
		
		Для Каждого стр из сборка.Товары Цикл
			нСтр = ордер.ТоварыПоРаспоряжениям.Добавить(); 
			нСтр.Распоряжение = сборка.Ссылка.ЗаказНаСборку;
			нСтр.Номенклатура = стр.Номенклатура;
			нСтр.Характеристика = стр.Характеристика;
			нСтр.Количество = стр.Количество;
			
		КонецЦикла;
		
		Документы.РасходныйОрдерНаТовары.ЗаполнитьОтгружаемыеТоварыПоТоварамПоРаспоряжениям(ордер);
		Для Каждого стр из ордер.ОтгружаемыеТовары Цикл
			Если ЗначениеЗаполнено(стр.Номенклатура) Тогда
				стр.Упаковка = стр.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;
		КонецЦикла;
		
		ордер.Записать(РежимЗаписиДокумента.Запись);
		ордер.Записать(РежимЗаписиДокумента.Проведение);
		
		ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтбору;
		ордер.Записать(РежимЗаписиДокумента.Проведение);
		
		Для Каждого стр из ордер.ОтгружаемыеТовары Цикл
			стр.Действие = Перечисления.ДействияСоСтрокамиОрдеровНаОтгрузку.Отгрузить;
		КонецЦикла;		
		ордер.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
        ордер.Записать(РежимЗаписиДокумента.Проведение);
		
		Возврат ордер.Ссылка;

	КонецЕсли;
КонецФункции

Функция УстановитьОбеспечениеЗаказа(заказ)ЭКСПОРТ
	оДок = заказ.ПолучитьОбъект();
	Если Ложь Тогда оДок = Документы.ЗаказНаСборку.СоздатьДокумент(); КонецЕсли;
	Для Каждого стр из оДок.Товары Цикл
		стр.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
	КонецЦикла;
	оДок.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	
	оДок.Записать(РежимЗаписиДокумента.Проведение);
КонецФункции


Функция СоздатьЗаказыНаСборку(Сборки)  ЭКСПОРТ
	
	СформированныеЗаказы = новый Массив;
	
	ТекстОшибкиЗаписи = НСтр("ru='%1 невозможно записать документ по причине:
								|%2'");
	ТекстОшибкиЗаполнения = НСтр("ru='%1 невозможно провести по причине некорректного заполнения.'");
	
	СпособыОбеспечения = Новый Соответствие;
	
	Для каждого СтрокаДанныеЗаказа Из Сборки Цикл
		Если НЕ СтрокаДанныеЗаказа.ОтметитьКЗаказу ИЛИ 
			СтрокаДанныеЗаказа.КоличествоУпаковок = 0 ИЛИ
			НЕ ЗначениеЗаполнено(СтрокаДанныеЗаказа.ВариантКомплектации)
			Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаполнения = Новый Структура("ХозяйственнаяОперация,Склад,Номенклатура,Характеристика,Назначение,ВариантКомплектации, Количество,
			|КоличествоУпаковок, Упаковка, НачалоСборкиРазборки, ОкончаниеСборкиРазборки, ДлительностьСборкиРазборки");
		
		//ДанныеЗаполнения.Вставить("ДлительностьСборкиРазборки", СтрокаДанныеЗаказа.ДлительностьСборкиРазборки);
		
		ДокументОбъект = Документы.ЗаказНаСборку.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		
		ДокументОбъект.Комментарий = НСтр("ru = 'Сформирован автоматически обработкой ""Формирование заказов на сборку (разборку) по плану"".'");
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовНаСборку") Тогда
			ДокументОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
		Иначе
			ДокументОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, СтрокаДанныеЗаказа);
		
		//ДанныеЗаполнения.НачалоСборкиРазборки = СтрокаДанныеЗаказа.ДатаНачалаСборки;
		//ДанныеЗаполнения.ОкончаниеСборкиРазборки = СтрокаДанныеЗаказа.НачалоПериодаСборки;
		
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		 
			
		Если ЗначениеЗаполнено(СтрокаДанныеЗаказа.Организация) Тогда
			ДокументОбъект.Организация = СтрокаДанныеЗаказа.Организация;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаДанныеЗаказа.Подразделение) Тогда
			ДокументОбъект.Подразделение = СтрокаДанныеЗаказа.Подразделение;
		КонецЕсли;
		
		//
		ДокументОбъект.НачалоСборкиРазборки = ДокументОбъект.Дата;
		ДокументОбъект.ОкончаниеСборкиРазборки = ДокументОбъект.Дата;
		
		ДокументОбъект.ДокументОснование = СтрокаДанныеЗаказа.ЗаказКлиента;

		
		//Попытка
			
			Если ДокументОбъект.ПроверитьЗаполнение() Тогда
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				Сообщения = ПолучитьСообщенияПользователю(Истина);
				ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибкиЗаполнения, Строка(ДокументОбъект.Ссылка)), 
					ДокументОбъект);
			КонецЕсли;
			
			СформированныеЗаказы.Добавить(ДокументОбъект.Ссылка);
			
		//Исключение
		//	
		//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование заказов на сборку (разборку) по плану'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		//		УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//		
		//	ТекстОшибки = ОписаниеОшибки();
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибкиЗаписи, Строка(ДокументОбъект.Ссылка), ТекстОшибки),
		//		ДокументОбъект);
		//	
		//КонецПопытки; 
		
	КонецЦикла; 
	
	Возврат СформированныеЗаказы;
КонецФункции
